In [1]:
import pandas as pd

In [8]:
titanic = pd.read_csv("./data/titanic.csv")
titanic.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
titanic.dtypes

In [12]:
titanic.to_excel('./data/titanic.xlsx',sheet_name="passengers",index=False)

In [16]:
titanic = pd.read_excel("./data/titanic.xlsx",sheet_name="passengers")

In [ ]:
titanic.info()

In [19]:
# ავიღოთ titanic df-დან Age Column და განვათავსოთ ages ცვლადში.
ages = titanic['Age']

In [ ]:
titanic[['Age','Sex']]

In [24]:
type(titanic[['Age','Sex']])

pandas.core.frame.DataFrame

Filter DataFrame Rows

In [30]:
# აბრუნებს მხოლოდ Boolean ტიპს არის თუ არა პირობა ჭეშმარიტი თითოეულ მონაცემზე
titanic['Age']>35
above_35 = titanic[titanic['Age']>35]

In [42]:
# isin ამოწმებს მასში გადაცემულ list-ში მყოფი ელემენტები არსებობს თუ არა Pclass-ში
class_23 = titanic[titanic['Pclass'].isin([2,3])]

In [46]:
age_no_na = titanic[titanic['Age'].notna()]
age_no_na.shape

(714, 12)

Select Specific rows & Columns

In [54]:
adult_names = titanic.loc[titanic['Age']>35,"Name"]

In [ ]:
titanic.iloc[9:25,2:5]

In [64]:
titanic.iloc[0:3,3] = "Anonymous"